{
    "basics": {
      "name": "Iker Gonzalez",
      "label": "Software Architect",
      "picture": "http://www.piedpiper.com/app/themes/pied-piper/dist/images/richard.png",
      "email": "ikergpe@gmail.com",
      "summary": "As an innovative and entrepreneurial professional, I thrive when given the autonomy and freedom to take ownership of projects and make decisions that drive impactful results. I am motivated by working with individuals who push boundaries and challenge the status quo, as I believe in the power of collaboration to achieve greatness. With a highly analytical mindset, I excel at dissecting complex problems and finding creative solutions. My business-oriented approach allows me to see the bigger picture and make strategic decisions that align with organizational goals. I have a passion for lifelong learning and continuously strive to expand my knowledge and skill set. Adapting to new technologies and trends is a priority for me, as I understand the importance of staying ahead in a rapidly evolving landscape. In my portfolio, you will find evidence of my ability to innovate, take ownership, and drive results. I am excited to contribute my expertise and work alongside like-minded individuals who are dedicated to making a difference.",
      "location": {
        "address": "Newell Road",
        "postalCode": "94303",
        "city": "Madrid",
        "countryCode": "SP",
        "region": ""
      },
      "profiles": [
        {
          "network": "LinkedIn",
          "username": "ikgonzal",
          "url": "https://www.linkedin.com/in/ikgonzal/"
        },
        {
          "network": "GitHub",
          "username": "iker-gonzalez",
          "url": "https://github.com/iker-gonzalez"
        }
      ]
    },
    "projects": [
      {
        "title": "Transcendence - TypeScript, ReactJS, NestJS, PostgreSQL, Docker, Sockets",
        "subtitle": "OAuth, 2 Factor Auth, Docker, Sockets",
        "website": "https://github.com/iker-gonzalez/ft_transcendence",
        "highlights": [
          "Unleash the ultimate Pong experience with our web app! Secure logins via 42 school OAuth, two-factor authentication, stats tracking, messaging, and live game sessions. Built with TypeScript, ReactJS, NestJS, and PostgreSQL, all neatly containerized with Docker for a seamless experience."
        ]
      },
      {
        "title": "Webserv - C++, Python, JS",
        "subtitle": "HTTP protocol, Client-Server arquitecture, NGINX, CGI, Sockets, fcntl",
        "website": "https://github.com/iker-gonzalez/webserv",
        "highlights": [
          "Development of HTTP server from scratch using C++. Testing is made with an actual browser."
        ]
      },
      {
        "title": "Ft Containers - C++",
        "subtitle": "Algorithms, Containers, Templates, Data-structures, Standard Template Library (STL), Operator overloading",
        "website": "https://github.com/iker-gonzalez/ft_containers",
        "highlights": [
          "Reimplementation of stack, vector and map container types of the C++ STL"
        ]
      },
      {
        "title": "Cub3D - C",
        "subtitle": "Raycasting, Algorithms, MiniLibX, Key Hooks, Graphic Design, Windows, Events, Mathematics",
        "website": "https://github.com/iker-gonzalez/cub3d",
        "highlights": [
          "Small simulated 3D game done using raycasting principles and inspired by the famous Wolfenstein 3D game"
        ]
      },
      {
        "title": "CPP Piscine - C++",
        "subtitle": "Polymorphism, Inheritance, References, Operator overloads, Interfaces, Virtual, Exceptions, Casts, Templates, STL",
        "website": "https://github.com/iker-gonzalez/cpp_piscine",
        "highlights": [
          "42 'piscine' which resembles a coding bootcamp on C++"
        ]
      },
      {
        "title": "Minishell - C",
        "subtitle": "Signals, Processes, Pipes, Readline",
        "website": "https://github.com/iker-gonzalez/42_minishell",
        "highlights": [
          "A Bash-inspired shell with a prompt and a working history",
          "Quotes interpretation, environment variables expansion, redirections, pipes, builtins, and signals"
        ]
      },
      {
        "title": "Philosophers - C",
        "subtitle": "Multithreading, Pthread API, Mutexes, Processes, Semaphores",
        "website": "https://github.com/iker-gonzalez/philosophers",
        "highlights": [
          "42's take on the classic Dining philosophers problem",
          "Mandatory part with threads and mutexes; bonus part with processes and semaphores"
        ]
      },
      {
        "title": "Push Swap - C",
        "subtitle": "Sorting algorithm, Linked lists",
        "website": "https://github.com/iker-gonzalez/push_swap",
        "highlights": [
          "Sort data on a stack, with a limited set of instructions, using the lowest possible number of actions",
          "The two available stacks were managed with linked lists"
        ]
      },
      {
        "title": "So Long - C",
        "subtitle": "MiniLibX",
        "website": "https://github.com/iker-gonzalez/so_long",
        "highlights": [
          "Small top-down, 2D game with textures, sprites, and basic gameplay",
          "Move the character around and collect enough collectibles to unlock the exit",
          "In the bonus version, a move counter is shown on the screen and enemies roam the board to kill the player"
        ]
      },
      {
        "title": "Minitalk - C",
        "subtitle": "Signals, Bitwise operations",
        "website": "https://github.com/iker-gonzalez/minitalk",
        "highlights": [
          "Small data exchange program using UNIX signals and bitwise operations",
          "A server listens for signals emitted by a client. The client receives a string as a parameter and sends it as binary to the server. The server receives the signals and output them to the console"
        ]
      }
      
    ],
    "work": [
      {
        "name": "Deutsche Telekom",
        "position": "Software Architect",
        "website": "https://www.telekom.com/en",
        "startDate": "2023-09-21",
        "summary": "Part of Telekom's Energy Cloud Enabling Squad, driving the digitalization of our energy consumption data.",
        "highlights": [
           "Architecting a big data project to seamlessly transition data into Google Cloud, managing data, CI/CD pipelines, and ensuring multi-cloud and on-premises integration.",
           "Deploying infrastructure efficiently with Terraform and making the most of BigQuery for advanced analytics and seamless data processing.",
           "Crafting comprehensive architecture documentation for stakeholders and future maintainers, emphasizing multi-cloud and on-premises considerations.",
           "Driving projects with SCRUM and agile methodologies, ensuring adaptability and efficiency.",
           "Utilizing a tech stack focused on Python and Go for software development, ensuring compatibility across diverse environments."
        ]
      },
      {
        "name": "Reprise Digital",
        "position": "Software Developer",
        "website": "https://reprisedigital.com/",
        "startDate": "2022-07-04",
        "endDate": "2023-09-20",
        "summary": "Creating software solution in Google Cloud for global brands within the digital marketing space.",
        "highlights": [
           "Developed Equilibrium, a comprehensive cloud solution that facilitates collaboration between SEO and SEM teams for efficient campaign cost optimization.",
           "Engineered sophisticated data pipelines to empower clients in making real-time data-driven choices.",
           "Constructed a comprehensive application stack to streamline the process of generating and delivering SEO recommendations.",
           "Utilized JavaScript, Python, REST APIs, Bigquery, Compute Engine, and Google Cloud Platform (GCP) for automation, data engineering, and software development initiatives.",
           "Engaged with renowned clients including Real Madrid, Johnson & Johnson, Dyson, Renfe, and Legalitas."
        ]
      },
      {
        "name": "Aiag Asesores",
        "position": "CTO & Co-founder",
        "website": "https://www.aiagasesores.com/",
        "startDate": "2018-12-01",
        "endDate": "2022-07-01",
        "summary": "As one of the co-founders, I gained a comprehensive understanding of the end-to-end process of initiating and maintaining a thriving business.",
        "highlights": [
          "As one of the co-founders, I gained a comprehensive understanding of the end-to-end process of initiating and maintaining a thriving business.",
          "Technical expertise: Proficient in web and software development, automation techniques, and search engine optimization (SEO).",
          "Skilled in project management: Consistently delivering results within strict timeframes.",
          "Proficient in marketing and sales: Successfully acquiring clients and generating revenue.",
          "Experienced in finance: Knowledgeable in accounting practices, tax regulations, and loan management.",
          "Engaged in research and development (R&D): Continuously adapting to emerging trends and acquiring new knowledge.",
          "Well-versed in interpersonal skills: Effectively managing team dynamics and meeting client expectations."
        ]
      }
    ],
    "education": [
      {
        "institution": "Google Cloud Platform (GCP)",
        "area": "GCP",
        "studyType": "Professional Data Engineer",
        "location": "Remote",
        "website": "https://cloud.google.com/learn/certification/data-engineer",
        "summary": "Certified GCP Data Engineer adept at designing, building, and securing data systems. Skilled in operationalizing machine learning models, ensuring quality, and leveraging existing solutions."
      },
      {
        "institution": "42",
        "area": "Computer Science",
        "studyType": "RNCP 6 - Equivalent to Bachelor's Degree",
        "location": "Urduliz, Basque Country",
        "website": "https://42.fr/en/homepage/",
        "startDate": "2021-04-12",
        "summary": "No teachers, peer to peer learning, open 24/7, gamified project-based methodology, international network. One of the most innovative coding schools in the world."
      },
      {
        "institution": "University of London",
        "area": "Digital Innovation",
        "studyType": "PGDip",
        "location": "London, UK",
        "website": "https://london.ac.uk/",
        "startDate": "2020-11-12",
        "summary": "Academic direction from The London School of Economics"
      },
      {
        "institution": "Brunel University London",
        "area": "Technology & Innovation Management",
        "studyType": "MSc",
        "location": "London, UK",
        "website": "https://www.brunel.ac.uk/",
        "startDate": "2018-01-12",
        "endDate": "2019-07-12",
        "summary": "Grade: Distinction"
      },
      {
        "institution": "University of Deusto",
        "area": "Law & Economics",
        "studyType": "LLB",
        "location": "Bilbao, Spain",
        "website": "https://www.deusto.es/cs/Satellite/deusto/es/universidad-deusto",
        "startDate": "2012-09-12",
        "endDate": "2016-07-12",
        "summary": "Grade: First-Class Honours"
      }
    ],
    "volunteer": [
      {
        "organization": "Circular Economy Club (CEC)",
        "position": "Bilbao Local Organizer",
        "website": "https://www.circulareconomyclub.com/",
        "startDate": "2019-01-01",
        "summary": "CEC is the international network of the circular economy field which builds strong local clubs who design, implement and support circular local initiatives."
      }
    ],
    "publications": [
      {
        "name": "Video compression for 3d media",
        "publisher": "Hooli",
        "releaseDate": "2014-10-01",
        "website": "http://en.wikipedia.org/wiki/Silicon_Valley_(TV_series)",
        "summary": "Innovative middle-out compression algorithm that changes the way we store data."
      }
    ],
    "skills": [
      {
        "name": "hard_skills",
        "keywords": ["CI / CD", "UML", "Docker", "Infrastructure as Code (IaC)", "Big Data", "Terraform", "Git", "GitHub", "GCP", "SEO", "Linux", "Bash", "HTML5", "CSS3", "React", "SCRUM"]
      },
      {
        "name": "soft_skills",
        "keywords": ["Team player", "Innovative", "Resilient", "Business-oriented", "Analytical", "Adaptable", "Self-motivated", "Creative", "Entrepreneurial", "Lifelong learner"]
      },
      {
        "name": "programming_languages",
        "keywords": ["C", "C++", "Python", "SQL", "Javascript", "TypeScript"]
      }
    ],
    "languages": [
      {
        "language": "English",
        "fluency": "Proficient - C2 Cambridge"
      },
      {
        "language": "Spanish",
        "fluency": "Native speaker"
      },
      {
        "language": "Basque",
        "fluency": "Native speaker"
      }
    ],
    "interests": [
      {
        "name": "Sports",
        "keywords": ["Surfing", "Crossfit", "Trekking"]
      },
      {
        "name": "Culture",
        "keywords": ["Travelling", "Eating"]
      }
    ],
    "references": [
      {
        "name": "Erlich Bachman",
        "reference": "It is my pleasure to recommend Richard. That is all."
      }
    ]
  }
  